altomaltes/libOTG-stm32f4/src/libs/otg/stm4/usb_corehost.c
/**
 *     AUTHOR: Jose Angel Caso Sanchez, 2023 ( altomaltes@yahoo.es )
 *                                           ( altomaltes@gmail.com )
 *
 *     Copyright (C) 2004, 2024 JACS
 *
 *   Heavily scrapped code. See original note below
 *
 * This software component was licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at: <http://www.st.com/SLA0044>
 *
 * @file usb_corehost.c
 *
 * original draft from MCD Application Team
 */

#include "usb_hcd.h"
#include "stm32f4.h"

/**
 * @brief  usbHOSTcoreInit : Initializes USB_OTG controller for host mode
 * @retval status
 */
schar usbHOSTcoreInit( )
{ word vbusPin= USB_OTG_Core.vbusPin & 0x0FFF; /* Extract ID pin flags */

  STM32F4.USB.GLOBAL.GAHBCFG.GINT= 0; /* Disasble interrupts */

/* Configure VBUS switch
 */
  if ( vbusPin )
  { PIN_MODE( vbusPin, GPIO_OUT | GPIO_HIGH );
    PIN_PUT( vbusPin, ( USB_OTG_Core.vbusPin & USB_VBUS_INV ) ? 0 : 1 );  /*ENABLE the Power Switch by driving the Enable LOW */
    mDelay( 400 );   /* Delay is need for stabilising the Vbus Low  in Reset Condition, when Vbus=1 and Reset-button is pressed by user */
  }

  STM32F4.USB.PWRCLK.FS_PCGCCTL.atomic= 0;  /* Restart the Phy Clock */ // USB_OTGWrite_ REG32(USB_OTG->regs.PCGCCTL, 0 );

  usbHOSTinitFSLSPClkSel( HCFG_48_MHZ );  /* Initialize Host Configuration Register */

  USBHdeInit();                            /* Clear previous state */
  usbHOSTresetPort();

  STM32F4.USB.HOST.HCFG.FSLSS= 0;          /** 0x02 FS- and LS-only support */


/* Configure data FIFO sizes
 *
 *  Rx FIFO
 */
  if ( (dword)&STM32F4.USB == 0x50000000 )            /* set Rx FIFO size  Full Speed */
  { STM32F4.USB.GLOBAL.GRXFSIZ.RXFD= RX_FIFO_FS_SIZE; /* set Rx FIFO size */

    STM32F4.USB.GLOBAL.DIEPTXF[ 0 ].TXSA= RX_FIFO_FS_SIZE;
    STM32F4.USB.GLOBAL.DIEPTXF[ 0 ].TXFD= TXH_NP_FS_FIFOSIZ;

    STM32F4.USB.GLOBAL.HPTXFSIZ[ 0 ].TXSA= RX_FIFO_FS_SIZE + TXH_NP_FS_FIFOSIZ;
    STM32F4.USB.GLOBAL.HPTXFSIZ[ 0 ].TXFD= TXH_P_FS_FIFOSIZ;
  }

  else if ( (dword)&STM32F4.USB == 0x40040000 )         /* set Rx FIFO size  High Speed */
  { STM32F4.USB.GLOBAL.GRXFSIZ.RXFD= RX_FIFO_HS_SIZE;   /* set Rx FIFO size */

    STM32F4.USB.GLOBAL.DIEPTXF[ 0 ].TXSA= RX_FIFO_HS_SIZE;
    STM32F4.USB.GLOBAL.DIEPTXF[ 0 ].TXFD= TXH_NP_HS_FIFOSIZ;

    STM32F4.USB.GLOBAL.HPTXFSIZ[ 0 ].TXSA= RX_FIFO_HS_SIZE + TXH_NP_HS_FIFOSIZ;
    STM32F4.USB.GLOBAL.HPTXFSIZ[ 0 ].TXFD= TXH_P_HS_FIFOSIZ;
  }
  else
  { return( -1 );  /* Out of sync */
  }

/* Make sure the FIFOs are flushed.
 */
  usbOTGflushTxFifo( 0x10 );         /* all Tx FIFOs */
  usbOTGflushRxFifo();


/* Clear all pending HC Interrupts
 */
  for ( int i = 0
      ;     i < USB_OTG_Core.hostChannels
      ;     i++ )
  { STM32F4.USB.HOST.HC[ i ].INT.atomic   = 0xFFFFFFFF;
    STM32F4.USB.HOST.HC[ i ].INTMSK.atomic= 0x00000000;
  }

  usbHOSTdriveVbus( 1 );

  usbOTGenableCommonInt( HOST_MODE );  /* Enable the common interrupts */
  STM32F4.USB.GLOBAL.GAHBCFG.GINT= 1; /* Enable interrupts ( global ) */
  return( 0 );
}

/**
 * @brief  usbHOSTisEvenFrame
 *         This function returns the frame number for sof packet
 * @retval Frame number
 */
byte usbHOSTisEvenFrame( )
{ return( STM32F4.USB.HOST.HFNUM.FRNUM  & 0x1 );
}

/**
 * @brief  usbHOSTdriveVbus : set/reset vbus
 * @param  state : VBUS state
 * @retval None
 */
void usbHOSTdriveVbus( byte state )
{ word vbusPin= USB_OTG_Core.vbusPin & 0x0FFF; /* Extract ID pin flags */

  if ( vbusPin )
  { PIN_PUT( vbusPin, ( USB_OTG_Core.vbusPin & USB_VBUS_INV )
                    ? !!state : !state   );  /*ENABLE the Power Switch by driving the Enable LOW */
    mDelay( 200 );
  }

  if (( STM32F4.USB.HOST.HPRT.PPWR == 0 ) && ( state == 1 )) /* Turn on the Host port power. */
  { //STM32F4.USB.HOST.HPRT.PENA=
    //STM32F4.USB.HOST.HPRT.PCDET=
    //STM32F4.USB.HOST.HPRT.PENCHNG=
    //STM32F4.USB.HOST.HPRT.POCCHNG= 0;

    STM32F4.USB.HOST.HPRT.PPWR= 1;
  }
  if (( STM32F4.USB.HOST.HPRT.PPWR == 1 ) && ( state == 0 ))
  { //STM32F4.USB.HOST.HPRT.PENA=
    //STM32F4.USB.HOST.HPRT.PCDET=
    //STM32F4.USB.HOST.HPRT.PENCHNG=
    //STM32F4.USB.HOST.HPRT.POCCHNG= 1;

    STM32F4.USB.HOST.HPRT.PPWR= 0;
  }

   mDelay( 200 );
}


/**
 * @brief  usbHOSTinitFSLSPClkSel : Initializes the FSLSPClkSel field of the
 *         HCFG register on the PHY type
 * @param  freq : clock frequency
 * @retval None
 */
void usbHOSTinitFSLSPClkSel( byte freq )
{ STM32F4.USB.HOST.HCFG.FSLSPCS= freq; /** 0x00 FS/LS PHY clock select */ // hcfg.b.fslspclksel = freq;
}


/**
 * @brief  usbHOSTresetPort : Reset Host Port
 * @retval status
 * @note : (1)The application must wait at least 10 ms (+ 10 ms security)
 *   before clearing the reset bit.
 */
byte usbHOSTresetPort( )
{ STM32F4.USB.HOST.HPRT.PENA   =    /** 0x02 Port enable                */
  STM32F4.USB.HOST.HPRT.PCDET  =    /** 0x01 Port connect detected      */
  STM32F4.USB.HOST.HPRT.PENCHNG=    /** 0x03 Port enable/disable change */
  STM32F4.USB.HOST.HPRT.POCCHNG= 0; /** 0x05 Port overcurrent change    */

  STM32F4.USB.HOST.HPRT.PRST= 1; mDelay( 200 ); /** 0x08 Port reset */
  STM32F4.USB.HOST.HPRT.PRST= 0; mDelay(  40 ); /** 0x08 Port reset */

  return( 1 );
}


/**
 * @brief  usbHOSTgetHCdad:
 * @param  hcNum : channel number
 * @retval schar : status STM32F4.USB.HOST.HC[ hcNum ]
 */
byte usbHOSTgetHCdad( byte hcNum )
{ return( STM32F4.USB.HOST.HC[ hcNum ].CHAR.DAD );
}


/**
 * @brief  usbHOSTinitC : Prepares a host channel for transferring packets
 * @param  hcNum : channel number
 * @retval schar : status STM32F4.USB.HOST.HC[ hcNum ]
 */

byte usbHOSTaddrHC( byte hcNum, byte devAddr )
{ return( STM32F4.USB.HOST.HC[ hcNum ].CHAR.DAD= devAddr );
}

byte usbHOSTpacketHC( byte hcNum, word maxPacket )
{ return( STM32F4.USB.HOST.HC[ hcNum ].CHAR.MPSIZ= maxPacket );
}

schar usbHOSTinitC( byte hcNum
                     , byte epAddr, byte epType
                     , byte devAddr, word maxPacket )
{ volatile struct HC_STRUCT * HC= STM32F4.USB.HOST.HC + hcNum;

  byte   doPing= epType & DO_PING_FLAG;
  byte lowSpeed= epType & LOW_SPEED_FLAG;

  epType &= 0x3;

  HC->INT.atomic= 0xFFFFFFFF;

  if ( USB_OTG_Core.dmaEnable )  /* Enable channel interrupts required for this transfer. */
  { HC->INTMSK.AHBERR_NW= 1;
  }

  switch( epType )
  { case USB_EP_TYPE_CTRL:
    case USB_EP_TYPE_BULK:
      HC->INTMSK.XFRC   = 1;
      HC->INTMSK.STALL  = 1;
      HC->INTMSK.XACTERR= 1;
      HC->INTMSK.DTGLERR= 1;
      HC->INTMSK.NAK    = 1;

