altomaltes/libOTG-stm32f4/src/libs/otg/stm4/usb_corehost.c
      if ( epAddr & 0x80 )
      { HC->INTMSK.BBERR = 1;
      }
      else
      { HC->INTMSK.NYET= 1;
        if ( doPing )
        { HC->INTMSK.ACK= 1;
      } }
    break;

    case USB_EP_TYPE_INTR:
      HC->INTMSK.XFRC   = 1;
      HC->INTMSK.NAK    = 1;
      HC->INTMSK.STALL  = 1;
      HC->INTMSK.XACTERR= 1;
      HC->INTMSK.DTGLERR= 1;
      HC->INTMSK.FRMOVRR= 1;

      if ( epAddr & 0x80 )       // EP is in
      { HC->INTMSK.BBERR = 1;
      }

    break;

    case USB_EP_TYPE_ISOC:
      HC->INTMSK.XFRC = 1;
      HC->INTMSK.FRMOVRR = 1;
      HC->INTMSK.ACK = 1;

      if ( epAddr & 0x80 )       // EP is in
      { HC->INTMSK.XACTERR = 1;
        HC->INTMSK.BBERR = 1;
      }
      break;
  }

  STM32F4.USB.HOST.HAINTMSK.HAINTM |= 1 << hcNum;  /* Enable the top level host channel interrupt. */
  STM32F4.USB.GLOBAL.GINTMSK.HCINT= 1;           /* Make sure host channel interrupts are enabled. */

/* Program the HCCHAR register
 */
  HC->CHAR.DAD  = devAddr;
  HC->CHAR.EPNUM= epAddr &  0x7F;
  HC->CHAR.EPDIR= epAddr >> 0x07;
  HC->CHAR.LSDEV= lowSpeed; // (USB_HOST . hc[ hcNum ].speed == HPRT0_PRTSPD_LOW_SPEED ) ? 1 : 0;
  HC->CHAR.EPTYP= epType;
  HC->CHAR.MPSIZ= maxPacket;

  if ( epType == HCCHAR_INTR )
  { HC->CHAR.ODDFRM= 1;
  }

  return( 0 );
}


/**
 * @brief  usbHOSTstartXferHC : Start transfer
 * @param  hcNum : channel number
 * @retval schar : status STM32_USB_HOST$FS_HCCHAR
 */
schar usbHOSTstartXferHC( byte hcNum, byte pid
                          , void * xferBuff, word xferLen )
{ volatile struct HC_STRUCT * HC= STM32F4.USB.HOST.HC + hcNum;

  union STM32_USB_HOST$HCTSIZ HSIZE; HSIZE.atomic= 0;

  word maxPacket= HC->CHAR.MPSIZ;   // JACS, recover from hardware
  word num_packets;
  word max_hc_pkt_count;
  max_hc_pkt_count = 256;

  union STM32_USB_HOST$FS_HCCHAR HCHAR;


/* Compute the expected number of packets associated to the transfer
 */
  if ( xferLen > 0 )
  { num_packets= ( xferLen
                 + maxPacket - 1 ) / maxPacket;

    if ( num_packets > max_hc_pkt_count )
    { num_packets= max_hc_pkt_count;
      xferLen = num_packets * maxPacket;
  } }
  else
  { num_packets = 1;
  }

  if ( HC->CHAR.EPDIR )    //  if ( USB_HOST . hc[ hcNum ].ep_ is_in )
  { xferLen= num_packets * maxPacket;
  }

/* Initialize the HCTSIZn register
 */
  HSIZE.XFRSIZ= xferLen;
  HSIZE.PKTCNT= num_packets;
  HSIZE.DPID  = pid;
  HC->TSIZ= HSIZE;

  if ( USB_OTG_Core.dmaEnable == 1 )
  { HC->DMA= (dword)xferBuff;
  }

  HCHAR= HC->CHAR;
    HCHAR.ODDFRM= usbHOSTisEvenFrame(); /** 0x1D Odd frame       */
    HCHAR.CHENA= 1;                      /** 0x1F Channel enable  */  /* Set host channel enable */
    HCHAR.CHDIS= 0;                      /** 0x1E Channel disable */
  HC->CHAR= HCHAR;

  if ( ! USB_OTG_Core.dmaEnable ) /* Slave mode */
  { if (( HC->CHAR.EPDIR == 0 ) && ( xferLen >  0 ))  /* EP is out */
    { word len_words= (xferLen + 3 ) / 4;

      if ( len_words > STM32F4.USB.HOST.HPTXSTS.PTXFSAVL )  /* check if there is enough space in FIFO space */
      { switch( HC->CHAR.EPTYP )
        { case USB_EP_TYPE_CTRL: /* Non periodic transfer */
          case USB_EP_TYPE_BULK:
            STM32F4.USB.GLOBAL.GINTMSK.NPTXFE= 1; /** 0x05 Non-periodic TxFIFO empty mask */ /* need to process data in nptxfempty interrupt */ //  intmsk.b.nptxfempty = 1;
          break;

          case USB_EP_TYPE_INTR:         /* Periodic transfer */
          case USB_EP_TYPE_ISOC:
            STM32F4.USB.GLOBAL.GINTMSK.PTXFE= 1; /** 0x1A Periodic TxFIFO empty mask */ /* need to process data in ptxfempty interrupt */
          break;
      } }

      usbOTGwritePacket( xferBuff
                       , hcNum
                       , xferLen );
  } }

  return( 0 );
}


/**
 * @brief  usbHOSThaltHC : Halt channel
 * @param  hcNum : channel number
 * @retval schar : status
 */
void usbHOSThaltHC( volatile struct HC_STRUCT * HC )
{ HC->CHAR.CHDIS= 1;    /** 0x1E Channel disable */

/* Check for space in the request queue to issue the halt.
 */
  if ( HC->CHAR.EPTYP == HCCHAR_CTRL
    || HC->CHAR.EPTYP == HCCHAR_BULK )
  { if ( STM32F4.USB.HOST.HPTXSTS.PTXQSAV /*  nptxsts.b.nptxqspcavail == 0 */)
    { HC->CHAR.CHENA= 0;  /** 0x1F Channel enable */
  } }
  else
  { if (  STM32F4.USB.HOST.HPTXSTS.PTXQSAV == 0 /* hptxsts.b.ptxqspcavail == 0 */ )
    { HC->CHAR.CHENA= 0;  /** 0x1F Channel enable */
  } }

  HC->CHAR.CHENA= 1;  /** 0x1F Channel enable */
}

void usbHOSThaltHCnum( byte hcNum )
{ usbHOSThaltHC( STM32F4.USB.HOST.HC + hcNum );
}

/**
 * @brief  Issue a ping token
 * @param  None
 * @retval : None
 */
schar usbHOSTdoPingHC( volatile struct HC_STRUCT * HC )
{ union STM32_USB_HOST$HCTSIZ HSIZE; HSIZE.atomic= 0;

//  union STM32_USB_HOST$FS_HCCHAR HCHAR= STM32F4.USB.HOST.HC[ hcNum ].CHAR;

  HSIZE.DOPNG_NW= 1;
  HSIZE.PKTCNT  = 1;
  HC->TSIZ= HSIZE;

  HC->CHAR.CHENA= 1;
  HC->CHAR.CHDIS= 0;
//  HC->CHAR= HCHAR;

  return( 0 );
}


/**
 * @brief  Stop the device and clean up fifo's
 * @param  None
 * @retval : None
 */
void USB_OTG_StopHost()
{ STM32F4.USB.HOST.HAINT.atomic=    0xFFFFFFFF;
  STM32F4.USB.HOST.HAINTMSK.atomic= 0x00000000;

  for ( dword i= 0  /* Flush out any leftover queued requests. */
      ;       i < USB_OTG_Core.hostChannels
      ;       i++ )
  { STM32F4.USB.HOST.HC[ i ].CHAR.CHENA= 0;
    STM32F4.USB.HOST.HC[ i ].CHAR.CHDIS= 1;
    STM32F4.USB.HOST.HC[ i ].CHAR.EPDIR= 0;
  }

  /* Flush the FIFO */
  usbOTGflushRxFifo(  );
  usbOTGflushTxFifo( 0x10 );
}


/* --------------------------- HCD ----------------------------------------------------- */

/**
  * @brief  HCD init
  *         Initialize the HOST portion of the driver.
  * @param  base_address: OTG base address
  * @retval Status
  */
schar HCD1init( )
{ STM32F4.USB.GLOBAL.GAHBCFG.GINT= 0; /* Disasble interrupts */
  usbHOSTcoreInit();                  /* Host initializations */
  usbOTGenableCommonInt( HOST_MODE );    /* Enable the common interrupts */
  STM32F4.USB.GLOBAL.GAHBCFG.GINT= 1; /* Enable interrupts ( global ) */
  return( 0 );
}


/**
  * @brief  HCDgetCurrentSpeed
  *         Get Current device Speed.
  * @retval Status
  */
dword HCDgetCurrentSpeed()
{ return( STM32F4.USB.HOST.HPRT.PSPD ); /** 0x11 Port speed */
}

/**
  * @brief  HCDresetPort
  *         Issues the reset command to device
  * @retval Status
  */
/*
 *  Before starting to drive a USB reset, the application waits for the OTG
 * interrupt triggered by the denounce done bit (DBCDNE bit in OTG_GOTGINT),
 * which indicates that the bus is stable again after the electrical denounce
 * caused by the attachment of a pull-up resistor on DP (FS) or DM (LS).
 */


dword HCDresetPort(  )
{ usbHOSTresetPort();
  return( 0 );
}


/* ----------------------------------------------- INT --------------------------------------------- */

