altomaltes/libOTG-stm32f4/src/libs/otg/stm4/usb_corehost.c
typedef enum
{ HC_ZERO = 0
, HC_IDLE
, HC_XFRC
, HC_HALTED
, HC_NYET
, HC_STALL
, HC_XACTERR
, HC_BBLERR
, HC_DATATGLERR

, HC_NAK
} HC_STATUS;

#define MAX_NACK 30

static byte HC_Status[ 12 ];  // USB_OTG_MAX_TX_FIFOS

/**
 * @brief  handleHcnOutISR
 *         Handles interrupt for a specific Host Channel
 *
 * @param  hcNum: Channel number
 * @retval status
 */
static word handleHcnOutISR( volatile struct HC_STRUCT * HC, word status )
{ volatile union STM32_USB_HOST$HCINT HCINT=
  { .atomic= HC->INT.atomic & HC->INTMSK.atomic
  };
  HC->INT= HCINT; /* Confirm to free to new ones */

  if ( HCINT.AHBERR_NW )
  { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
  }

  if ( HCINT.ACK )
  {    /* Clear interrupt */ //    CLEAR_HC_INT( HCINT, AHBERR_NW );
  }

  if ( HCINT.FRMOVRR )    /** 0x09 Frame overrun */
  { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
    usbHOSThaltHC( HC );
  }

  if ( HCINT.XFRC )        /** 0x00 Transfer completed */
  { HC->INTMSK.CHHLT= 1;   /** 0x01 Channel halted mask */
    usbHOSThaltHC( HC );

    status= HC_XFRC;
  }

  if ( HCINT.STALL )
  { HC->INTMSK.CHHLT= 1;   /** 0x01 Channel halted mask */
    usbHOSThaltHC(  HC );
    status= HC_STALL;
  }

  if ( HCINT.NAK )
  { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */

    if ( !USB_OTG_Core.dmaEnable )
    { usbHOSThaltHC( HC );
    }

    status= HC_NAK;
  }

  if ( HCINT.XACTERR )
  { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
    usbHOSThaltHC( HC );
    status= HC_XACTERR;
  }

  if ( HCINT.NYET )
  { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
    if ( ! USB_OTG_Core.dmaEnable )
    { usbHOSThaltHC( HC );
    }

    status= HC_NYET;
  }

  if ( HCINT.DTGLERR )  /** 0x0A Data toggle error */
  { HC->INTMSK.CHHLT= 1;    /** 0x01 Channel halted mask */
    usbHOSThaltHC( HC );

    status= HC_DATATGLERR;
  }

  if ( HCINT.CHHLT )         /** 0x01 Channel halted */
  { HC->INTMSK.CHHLT= 0;

    switch( status )
    { case HC_NAK    : status |= URB_STATE_NACK  << 8; break;
      case HC_STALL  : status |= URB_STATE_STALL << 8; break;
      case HC_XACTERR: status |= URB_STATE_ERROR << 8; break;

      case HC_NYET:
        if ( HC->INTMSK.ACK )          // do_ping
        { usbHOSTdoPingHC( HC );
        }
        status |= URB_STATE_NACK << 8;
      break;

      case HC_XFRC:
        status |= URB_STATE_DONE << 8;
        if ( HC->CHAR.EPTYP == USB_EP_TYPE_BULK )
        { status |= URB_TOGGLE_OUT << 8; // USBHtoggle( num, 0 ); // USB_HOST.hc[ num ].toggleOut ^= 1;
        }
      break;
  } }

  return( status );
}

/**
 * @brief  handleHcnInISR
 *         Handles interrupt for a specific Host Channel
 * @param  hcNum: Channel number
 * @retval status
 */
static word handleHcnInISR( volatile struct HC_STRUCT * HC, word status )
{ union STM32_USB_HOST$HCINT HCINT=
  { .atomic= HC->INT.atomic & HC->INTMSK.atomic
  };
  HC->INT= HCINT; /* Confirm to free to new ones */

  if ( HCINT.AHBERR_NW )
  { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
  }

  if ( HCINT.ACK )
  {  // CLEAR_HC_INT( hcreg,ack);
  }

  if ( HCINT.STALL )
  { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
    status= HC_STALL;
        /* Clear the NAK Condition */
      /* Clear the STALL Condition */
    HCINT.NAK= 0;    /* NOTE: When there is a 'stall', reset also nak,  else, the   will be overwritten by 'nak' in code below */
    usbHOSThaltHC( HC );
  }

  if ( HCINT.DTGLERR )       /** 0x0A Data toggle error */
  { HC->INTMSK.CHHLT= 1;     /** 0x01 Channel halted mask */
    usbHOSThaltHC( HC );
    status = HC_DATATGLERR;
  }

  if ( HCINT.FRMOVRR )
  { HC->INTMSK.CHHLT= 1;      /** 0x01 Channel halted mask */
    usbHOSThaltHC( HC );
  }

  if ( HCINT.XFRC )          /** 0x00 Transfer completed */
  { //if (USB_OTG_Core.dmaEnable == 1 )
    //{ USB_HOST.XferCnt[ num ]=  USB_HOST.hc[ num ].xferLen
    //                         -  HC->TSIZ.XFRSIZ;
   // çç  }

    status= HC_XFRC;


    if (( HC->CHAR.EPTYP == USB_EP_TYPE_CTRL )
    ||  ( HC->CHAR.EPTYP == USB_EP_TYPE_BULK ))
    { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
      usbHOSThaltHC( HC );

       status |= URB_TOGGLE_IN << 8; // USBHtoggle( num, 1 ); // ].toggleIn ^= 1;
    }

    else if ( HC->CHAR.EPTYP == USB_EP_TYPE_INTR )
    { HC->CHAR.ODDFRM= 1;
      status |= URB_STATE_DONE << 8;
  } }

  if ( HCINT.CHHLT ) /** 0x01 Channel halted */
  { HC->INTMSK.CHHLT= 0;

    switch( status )
    { case HC_XFRC:       status |=  URB_STATE_DONE  << 8; break;
      case HC_STALL:      status |=  URB_STATE_STALL << 8; break;
      case HC_XACTERR:
      case HC_DATATGLERR: status |=  URB_STATE_ERROR << 8; break;
      default: if ( HC->CHAR.EPTYP == USB_EP_TYPE_INTR )
      { status |= URB_TOGGLE_IN << 8;  // USBHtoggle( num, 1 ); // USB_HOST.hc[ num ].toggleIn ^= 1;
  } } }

  if ( HCINT.XACTERR )  /** 0x07 Transaction error */
  { HC->INTMSK.CHHLT= 1;    /** 0x01 Channel halted mask */
    status = HC_XACTERR;
    usbHOSThaltHC( HC );
  }

  if ( HCINT.NAK )
  { if ( HC->CHAR.EPTYP == USB_EP_TYPE_INTR)
    { HC->INTMSK.CHHLT= 1;  /** 0x01 Channel halted mask */
      if ( !USB_OTG_Core.dmaEnable )
      { usbHOSThaltHC( HC );
    } }

    status= HC_NAK | ( URB_STATE_NACK << 8 );

    if  (( HC->CHAR.EPTYP == USB_EP_TYPE_CTRL ) /* re-activate the channel  */
    ||   ( HC->CHAR.EPTYP == USB_EP_TYPE_BULK ))
    { HC->CHAR.CHENA= 1;
      HC->CHAR.CHDIS= 0;
  } }

  return( status );
}

/**
 * @brief  handleChannelISR
 *         This function indicates that one or more host channels has a pending
 * @retval status
 */
void handleChannelISR( )
{ /* Clear appropriate bits in HCINTn to clear the interrupt bit in
  * GINTSTS */

  word haint= STM32F4.USB.HOST.HAINT.HAINT;
  volatile struct HC_STRUCT * HC= STM32F4.USB.HOST.HC;
  word idx= 0;

  while( haint )      /* Process all bits */
  { if ( haint & 1 )  /* live */
    { word status= HC->CHAR.EPDIR
                 ? handleHcnInISR(  HC, HC_Status[ idx ] )
                 : handleHcnOutISR( HC, HC_Status[ idx ] );

