altomaltes/libOTG-stm32f4/src/libs/otg/stm4/usb_corehost.c
      HC_Status[ idx ]= status & 0xFF; status >>= 8;
      usbHOSTsetUrbState( idx, status );
    }

    haint >>= 1; HC++; idx++;
} }

/**
 * @brief  handleDisconnectISR
 *         Handles disconnect event.
 * @retval status
 */
WEAK byte gotDevDisconnected ()
{ return( 0 );
}


void handleDisconnectISR()
{ //STM32F4.USB.GLOBAL.GAHBCFG.GINT= 0;        /* Disasble interrupts */
  usbHostGotDisconnected( DEFAULT_DEVADDR );
  USBHdeInit();                              /* Host de-initializations */

//  STM32F4.USB.GLOBAL.GAHBCFG.GINT= 1;        /* Disasble interrupts */
}

/**
 * @brief  handleNptxfemptyISR
 *         Handles non periodic tx fifo empty.
 * @retval status
 */
void handleNptxfemptyISR()
{ word chNum= STM32F4.USB.GLOBAL.GNPTXSTS.CHNUM_NW;
  word chLen= USBHwritePacket( chNum, 0 );
  word lenWords= (chLen + 3) / 4;

  while (( STM32F4.USB.GLOBAL.GNPTXSTS.NPTXFSAV > lenWords) && ( chLen ))  /** 0x00 Non-periodic TxFIFO space available */
  { word len= STM32F4.USB.GLOBAL.GNPTXSTS.NPTXFSAV * 4;

    if ( len > chLen ) /* Last packet */
    { len= chLen;
      STM32F4.USB.GLOBAL.GINTMSK.NPTXFE= 1;  /** 0x05 Non-periodic TxFIFO empty mask */
    }

    lenWords= ( chLen + 3) / 4;
    chLen= USBHwritePacket( chNum, len );
} }

/**
 * @brief  handlePtxfemptyISR
 *         Handles periodic tx fifo empty
 * @retval status
 */
void handlePtxfemptyISR()
{ word chNum= STM32F4.USB.GLOBAL.GNPTXSTS.CHNUM_NW;
  word chLen= USBHwritePacket( chNum, 0 );

  word lenWords= (chLen + 3) / 4;

  while (( STM32F4.USB.HOST.HPTXSTS.PTXFSAVL > lenWords) && ( chLen ))  /** 0x00 Non-periodic TxFIFO space available */
  { word len= STM32F4.USB.HOST.HPTXSTS.PTXFSAVL * 4;

    if ( len > chLen ) /* Last packet */
    { len= chLen;
      STM32F4.USB.GLOBAL.GINTMSK.PTXFE= 1;  /** 0x05 Non-periodic TxFIFO empty mask */
    }

    lenWords= ( chLen + 3) / 4;
    chLen= USBHwritePacket( chNum, len );
} }

/**
 * @brief  handlePortISR
 *         This function determines which interrupt conditions have occurred
 * @retval status
 */
void handlePortISR( )
{ dword retval = 0;

  union STM32_USB_HOST$HPRT TOWRITE= STM32F4.USB.HOST.HPRT;

/* Clear the interrupt bits in GINTSTS */
  TOWRITE.PENA   = 0; /** 0x02 Port enable */;
  TOWRITE.PCDET  = 0; /** 0x01 Port connect detected */
  TOWRITE.PENCHNG= 0; /** 0x03 Port enable/disable change */
  TOWRITE.POCCHNG= 0; /** 0x04 Port overcurrent active */

  if ( STM32F4.USB.HOST.HPRT.PCDET )  /* Port Connect Detected */
  { TOWRITE.PCDET= 1;                 /** 0x01 Port connect detected */
    gotDevConnected();

    for( int i= 0
       ;     i < USB_OTG_Core.hostChannels
       ;     i++ )
    { HC_Status[ i ]= HC_ZERO;
    }

    retval |= 1;
  }

  if ( STM32F4.USB.HOST.HPRT.PENCHNG )   /* Port Enable Changed */
  { TOWRITE.PENCHNG = 1;                                       /** 0x03 Port enable/disable change */

    if ( STM32F4.USB.HOST.HPRT.PENA == 1 )                      /** 0x02 Port enable */
    { if (( STM32F4.USB.HOST.HPRT.PSPD == HPRT0_PRTSPD_LOW_SPEED  )
      ||  ( STM32F4.USB.HOST.HPRT.PSPD == HPRT0_PRTSPD_FULL_SPEED ))
      { if ( STM32F4.USB.HOST.HPRT.PSPD == HPRT0_PRTSPD_LOW_SPEED )
        { STM32F4.USB.HOST.HFIR.FRIVL= HFIR_USEC_CLOCKS;        /** 0x00 Frame interval, JACS, 1us step over 6Mhz (5999) */

          if ( STM32F4.USB.HOST.HCFG.FSLSPCS != HCFG_6_MHZ )    /** 0x00 FS/LS PHY clock select */
          { usbHOSTinitFSLSPClkSel( HCFG_6_MHZ );
      } } }

      gotDevPortEnabled();
      STM32F4.USB.GLOBAL.GINTMSK.DISCINT= 1;                   /** 0x1D Disconnect detected interrupt mask */
    }
    else
    { gotDevPortDisabled();
  } }

/* Overcurrent Change Interrupt
 */
  if ( STM32F4.USB.HOST.HPRT.POCCHNG ) /** 0x05 Port overcurrent change */
  { TOWRITE.POCCHNG = 1;
    retval |= 1;
  }

  STM32F4.USB.HOST.HPRT= TOWRITE;   /* Clear Port Interrupts */
}

/**
 * @brief  handleCanReadHOST
 *         Handles the Rx Status Queue Level Interrupt
 * @retval status
 */
void handleCanReadHOST( )
{ STM32F4.USB.GLOBAL.GINTMSK.RXFLVL= 0;  /** =1  0x04 Receive FIFO non-empty mask */ /* Disable the Rx Status Queue Level interrupt */

  union STM32_USB_GLOBAL$GRXSTSR GXSTS= STM32F4.USB.GLOBAL.GRXSTSP;  /** !!! Destructive read */

  byte chNum= GXSTS.EPNUM;
  word chCnt= GXSTS.BCNT;

  switch( GXSTS.PKTSTS )
  { case GRXSTS_PKTSTS_IN:
      USBHreadPacket( chNum, chCnt );   /* Read the data into the host buffer. */

      if ( STM32F4.USB.HOST.HC[ chNum ].TSIZ.PKTCNT > 0 ) /* re-activate the channel when more packets are expected */
      { STM32F4.USB.HOST.HC[ chNum ].CHAR.CHENA= 1; /** 0x1F Channel enable */
        STM32F4.USB.HOST.HC[ chNum ].CHAR.CHDIS= 0; /** 0x1E Channel disable */
      }
    break;

    case GRXSTS_PKTSTS_IN_XFER_COMP:
    case GRXSTS_PKTSTS_DATA_TOGGLE_ERR:
    case GRXSTS_PKTSTS_CH_HALTED:
    default: break;
  }

  STM32F4.USB.GLOBAL.GINTMSK.RXFLVL= 1;  /** 0x04 Receive FIFO non-empty mask */  /* Enable the Rx Status Queue Level interrupt */
}

/**
 * @brief  USB_OTG_USBH_handle_IncompletePeriodicXfer_ISR
 *         Handles the incomplete Periodic transfer Interrupt
 * @retval status
 */
void hndIncompPerXferISR(  )
{ STM32F4.USB.HOST.HC[ 0 ].CHAR.CHENA= 1; /** 0x1F Channel enable */
  STM32F4.USB.HOST.HC[ 0 ].CHAR.CHDIS= 1; /** 0x1E Channel disable */
}

/**
 * @brief  USBIrqHandlerHOST
 *         This function handles all USB Host Interrupts
 * @retval status
 */
INTERRUPT void USBIrqHandlerHOST( /* dword core */)
{ union STM32_USB_GLOBAL$GINTSTS INTS= STM32F4.USB.GLOBAL.GINTSTS; /* Read atomically */

  STM32F4.USB.GLOBAL.GINTSTS.atomic= 0xFFFFFFFF; /* Clear stored interrupts, allow new ones */

  if (( INTS.atomic &= STM32F4.USB.GLOBAL.GINTMSK.atomic ))
  {

  /* Host events
   */
    if ( INTS.DISCINT ) { handleDisconnectISR(); }  /** 0x1D Disconnect detected interrupt */
    if ( INTS.NPTXFE  ) { handleNptxfemptyISR(); }  /** 0x05 Non-periodic TxFIFO empty     */
    if ( INTS.PTXFE   ) { handlePtxfemptyISR (); }  /** 0x1A Periodic TxFIFO empty         */
    if ( INTS.HPRTINT ) { handlePortISR      (); }  /** 0x18 Host port interrupt           */
    if ( INTS.HCINT   ) { handleChannelISR   (); }  /** 0x19 Host channels interrupt       */

    if ( INTS.RXFLVL       ) handleCanReadHOST  ();     /** 0x04 RxFIFO non-empty */
    if ( INTS.INCOMPISOOUT ) hndIncompPerXferISR();     /** 0x15 Incomplete periodic transfer(Host mode) */
    if ( INTS.SOF          )                            /** 0x03 Start of frame */
    { handleSofHostISR( STM32F4.USB.HOST.HFNUM.FRNUM );
} } }









